Revit 2026 API

# IIFCEntityTreeUIServer Methods

---

The IIFCEntityTreeUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | ShowDialog | Shows dialog on managing IFCEntityTreeUI. |

#### Reference

IIFCEntityTreeUIServer Interface

Autodesk.Revit.UI Namespace